cases/openfoam/fluids/bump_in_channel_2d/solution/case/0/omega
/*--------------------------------*- C++ -*----------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      omega;
}

dimensions [0 0 -1 0 0 0 0];

// Free-stream specific dissipation rate.
// omega = k^0.5 / (Cmu^0.25 * l), with l = 0.1 * L_ref = 0.15
//       = (1.5e-6)^0.5 / (0.548 * 0.15) = 0.0149
internalField uniform 0.015;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 0.015;
    }
    outlet
    {
        type            inletOutlet;
        inletValue      uniform 0.015;
        value           uniform 0.015;
    }
    "wall_.*"
    {
        type            omegaWallFunction;
        value           uniform 60;
    }
    top
    {
        type            symmetry;
    }
    frontAndBack
    {
        type            empty;
    }
}
