cases/openfoam/fluids/bump_in_channel_2d/solution/case/0/p
/*--------------------------------*- C++ -*----------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}

dimensions [0 2 -2 0 0 0 0];

internalField uniform 0;

boundaryField
{
    inlet
    {
        type            zeroGradient;
    }
    outlet
    {
        type            fixedValue;
        value           uniform 0;
    }
    "wall_.*"
    {
        type            zeroGradient;
    }
    top
    {
        type            symmetry;
    }
    frontAndBack
    {
        type            empty;
    }
}
