cases/openfoam/fluids/bump_in_channel_2d/solution/case/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      transportProperties;
}

// Incompressible. Re_Lref = U * L_ref / nu = 1 * 1.5 / 5e-7 = 3e6
// matches the NASA TMR 2D bump-in-channel verification conditions
// (M=0.2, Re=3e6 based on bump chord L_ref=1.5 m). At M=0.2 the
// incompressible-vs-compressible Cf difference is ~1%, well inside
// T_good ~ 10% of gt.

transportModel  Newtonian;

nu              5e-07;
