cases/openfoam/fluids/bump_in_channel_2d/solution/case/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// Generated by gen_blockmesh.py - do not hand-edit; regenerate instead.

scale   1;

vertices
(
    (   -25.0      0.0      0.0)    // 0
    (     0.0      0.0      0.0)    // 1
    (     1.5      0.0      0.0)    // 2
    (    26.5      0.0      0.0)    // 3
    (   -25.0      5.0      0.0)    // 4
    (     0.0      5.0      0.0)    // 5
    (     1.5      5.0      0.0)    // 6
    (    26.5      5.0      0.0)    // 7
    (   -25.0      0.0      1.0)    // 8
    (     0.0      0.0      1.0)    // 9
    (     1.5      0.0      1.0)    // 10
    (    26.5      0.0      1.0)    // 11
    (   -25.0      5.0      1.0)    // 12
    (     0.0      5.0      1.0)    // 13
    (     1.5      5.0      1.0)    // 14
    (    26.5      5.0      1.0)    // 15
);

blocks
(
    hex (0 1 5 4 8 9 13 12)  (100 130 1) simpleGrading (0.05 50000 1)
    hex (1 2 6 5 9 10 14 13)  (160 130 1) simpleGrading (1 50000 1)
    hex (2 3 7 6 10 11 15 14)  (120 130 1) simpleGrading (20 50000 1)
);

edges
(
    polyLine 1 2
    (
        (0.048387 0.00000524 0)
        (0.096774 0.00008210 0)
        (0.145161 0.00040157 0)
        (0.193548 0.00120927 0)
        (0.241935 0.00277344 0)
        (0.290323 0.00532513 0)
        (0.338710 0.00900094 0)
        (0.387097 0.01379830 0)
        (0.435484 0.01955165 0)
        (0.483871 0.02593419 0)
        (0.532258 0.03248607 0)
        (0.580645 0.03866538 0)
        (0.629032 0.04391469 0)
        (0.677419 0.04773325 0)
        (0.725806 0.04974380 0)
        (0.774194 0.04974380 0)
        (0.822581 0.04773325 0)
        (0.870968 0.04391469 0)
        (0.919355 0.03866538 0)
        (0.967742 0.03248607 0)
        (1.016129 0.02593419 0)
        (1.064516 0.01955165 0)
        (1.112903 0.01379830 0)
        (1.161290 0.00900094 0)
        (1.209677 0.00532513 0)
        (1.258065 0.00277344 0)
        (1.306452 0.00120927 0)
        (1.354839 0.00040157 0)
        (1.403226 0.00008210 0)
        (1.451613 0.00000524 0)
    )
    polyLine 9 10
    (
        (0.048387 0.00000524 1)
        (0.096774 0.00008210 1)
        (0.145161 0.00040157 1)
        (0.193548 0.00120927 1)
        (0.241935 0.00277344 1)
        (0.290323 0.00532513 1)
        (0.338710 0.00900094 1)
        (0.387097 0.01379830 1)
        (0.435484 0.01955165 1)
        (0.483871 0.02593419 1)
        (0.532258 0.03248607 1)
        (0.580645 0.03866538 1)
        (0.629032 0.04391469 1)
        (0.677419 0.04773325 1)
        (0.725806 0.04974380 1)
        (0.774194 0.04974380 1)
        (0.822581 0.04773325 1)
        (0.870968 0.04391469 1)
        (0.919355 0.03866538 1)
        (0.967742 0.03248607 1)
        (1.016129 0.02593419 1)
        (1.064516 0.01955165 1)
        (1.112903 0.01379830 1)
        (1.161290 0.00900094 1)
        (1.209677 0.00532513 1)
        (1.258065 0.00277344 1)
        (1.306452 0.00120927 1)
        (1.354839 0.00040157 1)
        (1.403226 0.00008210 1)
        (1.451613 0.00000524 1)
    )
);

boundary
(
    inlet
    {
        type patch;
        faces ((0 8 12 4));
    }
    outlet
    {
        type patch;
        faces ((3 7 15 11));
    }
    wall_up
    {
        type wall;
        faces ((0 1 9 8));
    }
    wall_bump
    {
        type wall;
        faces ((1 2 10 9));
    }
    wall_down
    {
        type wall;
        faces ((2 3 11 10));
    }
    top
    {
        type symmetry;
        faces
        (
            (4 12 13 5)
            (5 13 14 6)
            (6 14 15 7)
        );
    }
    frontAndBack
    {
        type empty;
        faces
        (
            (0 4 5 1)
            (1 5 6 2)
            (2 6 7 3)
            (8 9 13 12)
            (9 10 14 13)
            (10 11 15 14)
        );
    }
);

mergePatchPairs ();
