cases/openfoam/fluids/bump_in_channel_2d/solution/case/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}

application     simpleFoam;

startFrom       startTime;
startTime       0;

stopAt          endTime;
endTime         5000;

deltaT          1;

writeControl    timeStep;
writeInterval   1000;

purgeWrite      2;

writeFormat     ascii;
writePrecision  8;
writeCompression off;

timeFormat      general;
timePrecision   6;

runTimeModifiable true;

functions
{
    wallShearStress1
    {
        type            wallShearStress;
        libs            (fieldFunctionObjects);
        writeControl    writeTime;
        writeFields     true;
        patches         (wall_bump);
    }

    // Sample wallShearStress on the wall patch to a .raw file with
    // (x y z tau_x tau_y tau_z) per face. The post-processor uses
    // this to extract C_f at x=0.63, 0.75, 0.87.
    wallSurfaceSample
    {
        type            surfaces;
        libs            (sampling);
        writeControl    writeTime;
        interpolationScheme cellPoint;
        surfaceFormat   raw;
        fields          (wallShearStress);
        surfaces
        {
            wallSurface
            {
                type    patch;
                patches (wall_bump);
                interpolate false;
            }
        }
    }

    forces1
    {
        type            forceCoeffs;
        libs            (forces);
        writeControl    timeStep;
        writeInterval   100;

        patches         (wall_bump);
        rho             rhoInf;
        rhoInf          1;
        CofR            (0 0 0);
        liftDir         (0 1 0);
        dragDir         (1 0 0);
        pitchAxis       (0 0 1);
        magUInf         1;
        lRef            1.5;       // bump chord
        Aref            1.5;       // L_ref * unit-span (z-thickness=1)
    }
}
